In [4]:
import pandas as pd

Load the sample data

In [26]:
df = pd.read_csv('example.csv', decimal='.', thousands=',', index_col=0)

Use head() to get the first columns as sample data.

In [27]:
df.head()

                      name   revenue  unit_price
id
WBX         World of Beans   9000000       49.99
PP1              Peter Pan    873000       15.99
AOGD  The Adventures of GR  12000000       17.99
ML                 My Life    528000       39.99
TF              The Flight   1835000       25.99

Use info() to get column data, a great tool to spot null values that need remapping.

In [28]:
df.info()

<class 'pandas.core.frame.DataFrame'>
Index: 6 entries, WBX to CW
Data columns (total 3 columns):
name          6 non-null object
revenue       6 non-null int64
unit_price    6 non-null float64
dtypes: float64(1), int64(1), object(1)
memory usage: 192.0+ bytes

Speaking of columns, getting the columns shows which columns we are dealing with.

In [29]:
df.columns

Index(['name', 'revenue', 'unit_price'], dtype='object')

For bigger datasets that do not easily fit a preview, printing the shape is very helpful.

In [30]:
df.shape

(6, 3)

In case we have a column that does not have the desired type, we can cast it to the desired type.

In [36]:
df['revenue'] = df['revenue'].astype('float64')

For the numerical columns we have in out data frame we can call describe to get some statistical insights.

In [32]:
df.describe()

            revenue  unit_price
count  6.000000e+00    6.000000
mean   4.544000e+06   33.323333
std    4.789349e+06   15.422927
min    5.280000e+05   15.990000
25%    1.113500e+06   19.990000
50%    2.431500e+06   32.990000
75%    7.507000e+06   47.490000
max    1.200000e+07   49.990000

If we'd like to include other data types as well in the analysis, it needs to be explicitely passed.

In [37]:
df.describe(include=['object'])

             name
count           6
unique          6
top     Peter Pan
freq            1

We can even go as far as getting the number of occurences, normalize calculates the fractions.

In [39]:
df['name'].value_counts(normalize=True)

Peter Pan               0.166667
The Adventures of GR    0.166667
World of Beans          0.166667
The Flight              0.166667
Cold War                0.166667
My Life                 0.166667
Name: name, dtype: float64

Should sorting be needed, pandas can do that for us:

In [42]:
df.sort_values(by='revenue', ascending=True)

                      name     revenue  unit_price
id
ML                 My Life    528000.0       39.99
PP1              Peter Pan    873000.0       15.99
TF              The Flight   1835000.0       25.99
CW                Cold War   3028000.0       49.99
WBX         World of Beans   9000000.0       49.99
AOGD  The Adventures of GR  12000000.0       17.99